Core Template AMI/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../Parameters/snappyHexMeshDict_parameters.cpp"



// Which of the steps to run
castellatedMesh $castellatedMesh;
snap            $snap;
addLayers       $addLayers;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    innerCylinder.stl
    {
        type        triSurfaceMesh;
        file        "innerCylinder.stl";
        name        innerCylinder;
        regions
        {
            innerCylinder
            {
                name    innerCylinder;
            }
        }
    }
    outerCylinder.stl
    {
        type        triSurfaceMesh;
        file        "outerCylinder.stl";
        name        outerCylinder;
        regions
        {
            outerCylinder
            {
                name    outerCylinder;
            }
        }
    }

    propellerTip.stl
    {
        type        triSurfaceMesh;
        file        "propellerTip.stl";
        name        propellerTip;
        regions
        {
            patch0
            {
                name    propellerTip;
            }
        }
    }
    
}


// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells $maxLocalCells;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells $maxGlobalCells;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells $minRefinementCells;

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
    maxLoadUnbalance $maxLoadUnbalance;


    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels $nCellsBetweenLevels;



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        //{
        //    file        "innerCylinder.eMesh";
        //    level       4;
        //}
        {
            file        "propellerTip.eMesh";
            level       4;
        }

    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        innerCylinder
        {
            level       $innerCylinderSurfaceRefinementLevel;
         
            faceType    boundary;
            cellZone    innerCylinder;
            faceZone    innerCylinder;
            cellZoneInside  inside;
        }
        propellerTip
        {
            level       $propellerTipSurfaceRefinementLevel;
        }
    }

    // Resolve sharp angles
    resolveFeatureAngle 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
        outerCylinder
        {
            mode        inside;
            levels      $outerCylinderRefinementRegionLevel;
        }

        innerCylinder
        {
            mode $innerCylinderRefinementRegionMode;
            levels $innerCylinderRefinementRegionLevel;
        }

        //innerCylinder
        //{
          //  mode        inside;
            //levels      ((1E15 3));
        //}

        //}
        propellerTip
        {
            mode $propellerTipRefinementRegionMode;
            levels $propellerTipRefinementRegionLevel;
        }
    }
    


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh (0.01 -0.5 0.01);


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces false;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch $nSmoothPatch;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance $tolerance;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter $nSolveIter;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter $nRelaxIter;

    // Feature snapping

        // Number of feature edge snapping iterations.
        // Leave out altogether to disable.
        nFeatureSnapIter $nFeatureSnapIter;

        // Detect (geometric only) features by sampling the surface
        // (default=false).
        implicitFeatureSnap $implicitFeatureSnap;

        // Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap $explicitFeatureSnap;

        // Detect features between multiple surfaces
        // (only for explicitFeatureSnap, default = false)
        multiRegionFeatureSnap $multiRegionFeatureSnap;
}


addLayersControls
{
    relativeSizes $relativeSizes;

    layers
    {
        propellerTip
        {
            nSurfaceLayers $propellerTipSurfaceLayers;
        }
    }

    expansionRatio      $expansionRatio;
    firstLayerThickness $firstLayerThickness;
    // optional:
    // thickness        0.003;     // ~3 mm total, if you want to cap it

    minThickness        $minThickness;
    nGrow               $nGrow;

    featureAngle        $featureAngle;
    nRelaxIter          $addLayersnRelaxIter;

    nSmoothSurfaceNormals $nSmoothSurfaceNormals;
    nSmoothNormals        $nSmoothNormals;
    nSmoothThickness      $nSmoothThickness;

    maxFaceThicknessRatio     $maxFaceThicknessRatio;
    maxThicknessToMedialRatio $maxThicknessToMedialRatio;
    minMedialAxisAngle        $minMedialAxisAngle;

    nLayerIter           $nLayerIter;
    nBufferCellsNoExtrude $nBufferCellsNoExtrude;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    //- Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho $maxNonOrtho;

    //- Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness $maxBoundarySkewness;
    maxInternalSkewness $maxInternalSkewness;

    //- Max concaveness allowed. Is angle (in degrees) below which concavity
    //  is allowed. 0 is straight face, <0 would be convex face.
    //  Set to 180 to disable.
    maxConcave $maxConcave;

    //- Minimum pyramid volume. Is absolute volume of cell pyramid.
    //  Set to a sensible fraction of the smallest cell volume expected.
    //  Set to very negative number (e.g. -1E30) to disable.
    minVol $minVol;

    //- Minimum quality of the tet formed by the face-centre
    //  and variable base point minimum decomposition triangles and
    //  the cell centre. This has to be a positive number for tracking
    //  to work. Set to very negative number (e.g. -1E30) to
    //  disable.
    //     <0 = inside out tet,
    //      0 = flat tet
    //      1 = regular tet
    minTetQuality -1; // 1e-30;

    //- Minimum face area. Set to <0 to disable.
    minArea -1;

    //- Minimum face twist. Set to <-1 to disable. dot product of face normal
    //  and face centre triangles normal
    minTwist 0.01;

    //- Minimum normalised cell determinant
    //  1 = hex, <= 0 = folded or flattened illegal cell
    minDeterminant 0.001;

    //- minFaceWeight (0 -> 0.5)
    minFaceWeight 0.05;

    //- minVolRatio (0 -> 1)
    minVolRatio 0.01;

    //must be >0 for Fluent compatibility
    minTriangleTwist -1;


    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- Amount to scale back displacement at error points
    errorReduction 0.75;

    // Optional : some meshing phases allow usage of relaxed rules.
    // See e.g. addLayersControls::nRelaxedIter.
    relaxed
    {
        //- Maximum non-orthogonality allowed. Set to 180 to disable.
        maxNonOrtho 75;
    }
}



// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance $mergeTolerance;


// ************************************************************************* //